### For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

#### * Has the network latency gone up since we switched internet service providers?

* Null hypothesis:  There is no difference in network latency since we switched ISPs.
* Alternative hypothesis:  Network latency has increased since we switched ISPs.
* True positive:  Average network latency is higher with the new ISP than the previous ISP.
* True negative:  Average network latency is the same with the new ISP than the previous ISP.
* Type 1 error:  Average network latency appears higher because of periods of excessive traffic.
* Type 2 error:  Average network latency appears the same because of periods of extremely low traffic.

#### * Is the website redesign any good?

* Null hypothesis:  There is no difference in the click-through rate before th redesign.
* Alternative hypothesis:  The website redesign has increase click-through rate.
* True positive:  Click-through rate has increased by 10%
* True negative:  Click-through rate is within 10% of the previous value.
* Type 1 error:  Click-through rate has increased because of a sale, but has a similar click-through rate to the previous design during a sale period.
* Type 2 error:  Click-through rate decreases due to website down time and does not increase enough to be considered positive.

#### * Is our television ad driving more sales?

* Null hypothesis:  Sales revenue remained the same with the TV ad.
* Alternative hypothesis:  The TV ad has increase sales revenue.
* True positive:  Daily revenue is 20% higher during the period of the TV ad.
* True negative:  Daily revenue is within 20% of the daily revenue with no ad.
* Type 1 error:  Daily revenue increases because of a large recurring order during the period of the TV ad.
* Type 2 error:  Daily revenue is within 20% of the daily revenue with no ad because of an economic recession causing customers to buy less.

In [2]:
import sys
from env import user, password, host, util_repo, data_path
sys.path.append(util_repo)

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
from scipy import stats
from utilities import evaluate_hypothesis_ttest, generate_db_url

### 1. Ace Realty wants to determine whether the average time it takes to sell homes is different for its two offices. A sample of 40 sales from office #1 revealed a mean of 90 days and a standard deviation of 15 days. A sample of 50 sales from office #2 revealed a mean of 100 days and a standard deviation of 20 days. Use a .05 level of significance.

In [ ]:
null_hypothesis = "There is no difference in the average time it takes to sell houses between the two offices."
alternative_hypothesis = "The average time it takes to sell houses between the two offices differ."

confidence = .95
alpha = 1 - confidence

In [ ]:
t, p = stats.ttest_ind_from_stats(90, 15, 40, 100, 20, 50)

In [ ]:
evaluate_hypothesis_ttest(null_hypothesis, alternative_hypothesis, alpha, p, t)

#### The average time it takes to sell house IS different between the two offices.

### 2. Load the mpg dataset and use it to answer the following questions:

In [19]:
from pydataset import data

In [5]:
# Same confidence level for all questions
confidence = .95
alpha = 1 - confidence

mpg = data("mpg")
mpg['avg_mpg'] = mpg[['cty', 'hwy']].mean(axis = 1)

mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,avg_mpg
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

In [6]:
# Alternative solution
# harmonic mean = 2 / (1/cty + 1/hwy); use harmonic if calculating the average while keeping the unit of the numerator constant (miles in this case)
# arithmetic mean = (cty + hwy) / 2; use arithmetic if calculating the average while keeping the unit of the denominator constant (gallons of fuel)
mpg['hmean_mpg'] = stats.hmean(mpg[['cty', 'hwy']], axis = 1)
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,avg_mpg,hmean_mpg
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,22.212766
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,24.360000
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,24.313725
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,24.705882
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,19.809524

* Is there a difference in fuel-efficiency in cars from 2008 vs 1999?

In [7]:
# Two-sample, two-tailed test
null_hypothesis = "There is no difference in avg_mpg between 1999 and 2008 cars"
alt_hypothesis = "There is a difference in avg_mpg between 1999 and 2008 cars"

mpg_2008 = mpg[mpg.year == 2008]
mpg_1999 = mpg[mpg.year == 1999]

t, p = stats.ttest_ind(mpg_1999.avg_mpg, mpg_2008.avg_mpg)

In [9]:
evaluate_hypothesis_ttest(null_hypothesis, alt_hypothesis, alpha, p, t)

t:  0.8263744040323578, p:  0.050000000000000044, a:  0.21960177245940962

We reject the null hypothesis.
We move forward with the alternative hypothesis:  There is a difference in avg_mpg between 1999 and 2008 cars

#### We cannot reject the null hyothesis that there is no difference in avg_mpg between 1999 and 2008 cars

* Are compact cars more fuel-efficient than the average car?

In [10]:
# One-sample, one-tailed test
null_hypothesis = "Compact cars are just as fuel-efficient as the average car"
alt_hypothesis = "Compact cars are more fuel-efficient than average cars"

mpg_compact = mpg[mpg['class'] == "compact"]
mpg_non_compact = mpg[mpg['class'] != "compact"]

t, p = stats.ttest_ind(mpg_compact.avg_mpg, mpg_non_compact.avg_mpg)

In [11]:
# Alternative solution
t, p =stats.ttest_1samp(mpg_compact.avg_mpg, mpg_non_compact.avg_mpg.mean(), alternative = "greater")

In [12]:
evaluate_hypothesis_ttest(null_hypothesis, alt_hypothesis, alpha, p, t, "greater")

t:  2.967609174837242e-13, p:  0.050000000000000044, a:  9.881668054080286

We reject the null hypothesis.
We move forward with the alternative hypothesis:  Compact cars are more fuel-efficient than average cars

#### We reject the null hypothesis that compact car are just as fuel-efficient as the average car

* Do manual cars get better gas mileage than automatic cars?

In [13]:
# Two-sample, one-tail test
null_hypothesis = "Manual cars have the same avg_mpg as automatic cars"
alt_hypothesis = "Manual cars have a higher avg_mpg than automatic cars"

mpg['simple_trans'] = mpg.trans.str.rsplit("(", 1).str[0]

mpg_manual = mpg[mpg.simple_trans == "manual"]
mpg_auto = mpg[mpg.simple_trans == "auto"]

t, p = stats.ttest_ind(mpg_manual.avg_mpg, mpg_auto.avg_mpg)

In [14]:
evaluate_hypothesis_ttest(null_hypothesis, alt_hypothesis, alpha, p, t, "greater")

t:  7.154374401145683e-06, p:  0.050000000000000044, a:  4.593437735750014

We reject the null hypothesis.
We move forward with the alternative hypothesis:  Manual cars have a higher avg_mpg than automatic cars

#### We reject the null hypothesis that manual cars have the same avg_mpg as automatic cars and move forward with the hypothesis that manual cars have a higher avg_mpg than automatic cars.

# Correlation exercises

1. Use the `telco_churn` data.

In [89]:
telco_churn = pd.read_csv(data_path + "/Cust_Churn_Telco.csv")

# Clean the data
telco_churn.TotalCharges.replace(" ", np.nan, inplace = True)
telco_churn.dropna(inplace = True)
telco_churn.sort_values("TotalCharges")

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
105,6180-YBIQI,Male,0,No,No,5,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,No,Mailed check,24.30,100.2,No
4459,3178-FESZO,Female,0,No,No,1,Yes,Yes,Fiber optic,No,...,No,No,Yes,Yes,Month-to-month,Yes,Credit card (automatic),100.25,100.25,Yes
1723,2587-YNLES,Female,0,Yes,Yes,6,Yes,No,No,No internet service,...,No internet service,No internet service,No internet service,No internet service,Two year,No,Mailed check,20.10,100.35,No
2124,7802-EFKNY,Male,0,Yes,No,5,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,24.95,100.4,Yes
2208,7216-EWTRS,Female,1,Yes,No,1,Yes,Yes,Fiber optic,No,...,Yes,No,Yes,Yes,Month-to-month,Yes,Electronic check,100.80,100.8,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6646,8249-THVEC,Male,0,Yes,Yes,51,Yes,No,No,No internet service,...,No internet service,No internet service,No internet service,No internet service,One year,No,Mailed check,19.40,997.75,No
5598,6051-PTVNS,Female,0,Yes,Yes,55,Yes,No,No,No internet service,...,No internet service,No internet service,No internet service,No internet service,One year,No,Credit card (automatic),19.15,998.1,No
3686,5899-MQZZL,Female,0,No,No,13,Yes,Yes,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Mailed check,75.00,999.45,Yes
3353,4536-PLEQY,Male,0,Yes,No,12,Yes,No,Fiber optic,No,...,No,No,No,Yes,Month-to-month,Yes,Credit card (automatic),85.05,999.8,No
2845,9093-FPDLG,Female,0,No,No,11,Yes,No,Fiber optic,No,...,Yes,Yes,No,Yes,Month-to-month,Yes,Electronic check,94.20,999.9,No

* Does tenure correlate with monthly charges?

In [94]:
x = telco_churn.tenure
y = telco_churn.MonthlyCharges

corr, p = stats.pearsonr(x, y)
corr, p

(0.24686176664089346, 3.9898213232673846e-98)

#### Tenure has a slightly positive correlation with monthly charges

* Total charges?

In [95]:
y = telco_churn.TotalCharges.astype(float)

In [96]:
corr, p = stats.pearsonr(x, y)
corr, p

(0.825880460933202, 0.0)

* What happens if you control for phone and internet service?

In [107]:
phone_service = telco_churn[(telco_churn.PhoneService == "Yes") & (telco_churn.InternetService != "No")]

x = phone_service.tenure
charges_month = phone_service.MonthlyCharges
charges_total = phone_service.TotalCharges.astype(float)

In [103]:
# Monthly
corr, p = stats.pearsonr(x, charges_month)
corr, p

(0.4429835314205353, 1.9985481080656104e-231)

In [108]:
# Total
corr, p = stats.pearsonr(x, charges_total)
corr, p

(0.9579229778029189, 0.0)

2. Use the employees database.

In [3]:
employees_select = """
SELECT *
	FROM employees
		JOIN dept_emp de USING(emp_no)
		JOIN salaries s USING(emp_no)
	WHERE de.to_date > now() 
		AND s.to_date > now()
"""
employees_url = generate_db_url(user, password, host, "employees")

In [5]:
employees_df = pd.read_sql(employees_select, employees_url)
employees_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date,to_date,salary,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,d005,1986-06-26,9999-01-01,88958,2002-06-22,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,d007,1996-08-03,9999-01-01,72527,2001-08-02,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,d004,1995-12-03,9999-01-01,43311,2001-12-01,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,d004,1986-12-01,9999-01-01,74057,2001-11-27,9999-01-01
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,d003,1989-09-12,9999-01-01,94692,2001-09-09,9999-01-01

* Is there a relationship between how long an employee has been with the company and their salary?

In [ ]:
from datetime import datetime

In [6]:
employees_df['tenure'] = datetime.now().date() - employees_df.hire_date

x = employees_df.tenure.astype(int)
y = employees_df.salary

corr, p = stats.pearsonr(x, y)
corr, p

(0.3064625613186078, 0.0)

* Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [7]:
titles_select = """
SELECT *
	FROM employees
		JOIN dept_emp de USING(emp_no)
		JOIN titles t USING(emp_no)
	WHERE de.to_date > now()
"""

titles_df = pd.read_sql(titles_select, employees_url)
titles_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date,to_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,d005,1986-06-26,9999-01-01,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,d007,1996-08-03,9999-01-01,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,d004,1995-12-03,9999-01-01,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,d004,1986-12-01,9999-01-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,d004,1986-12-01,9999-01-01,Senior Engineer,1995-12-01,9999-01-01

In [8]:
titles_df['tenure'] = (datetime.now().date() - titles_df.hire_date).dt.days
titles_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date,to_date,title,from_date,to_date,tenure
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,d005,1986-06-26,9999-01-01,Senior Engineer,1986-06-26,9999-01-01,12650
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,d007,1996-08-03,9999-01-01,Staff,1996-08-03,9999-01-01,12867
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,d004,1995-12-03,9999-01-01,Senior Engineer,1995-12-03,9999-01-01,12587
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,d004,1986-12-01,9999-01-01,Engineer,1986-12-01,1995-12-01,12492
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,d004,1986-12-01,9999-01-01,Senior Engineer,1995-12-01,9999-01-01,12492

In [18]:
x = titles_df.groupby('emp_no').tenure.sum()
y = titles_df.groupby('emp_no').title.count()

corr, p = stats.pearsonr(x, y)
corr, p

(0.963346817594467, 0.0)

3. Use the sleepstudy data. Is there a relationship between days and reaction time?

In [22]:
sleep_df = data("sleepstudy")
sleep_df.head()

   Reaction  Days  Subject
1  249.5600     0      308
2  258.7047     1      308
3  250.8006     2      308
4  321.4398     3      308
5  356.8519     4      308

In [36]:
avg_reaction = sleep_df.groupby("Days").Reaction.mean()
avg_reaction

Days
0    256.651806
1    264.495756
2    265.361900
3    282.992011
4    288.649422
5    308.518456
6    312.178256
7    318.750583
8    336.629506
9    350.851222
Name: Reaction, dtype: float64

In [35]:
x = avg_reaction.index
y = avg_reaction.values

corr, p = stats.pearsonr(x, y)
corr, p

(0.9893180251905147, 5.623495872574426e-08)